In [2]:
import pandas as pd
df = pd.read_csv(r"C:\Users\ponna\Downloads\weather_data.csv")
df

          DATE       CITy  TEMPERATURE  HUMIDITY_% CONDITION
0   01-01-1900  HYDERABAD           28          60     SUNNY
1   02-01-1990  HYDERABAD           29          52     SUNNY
2   03-01-1990  HYDERABAD           30          58    CLOUDY
3   04-01-1990  HYDERABAD           31          55    CLOUDY
4   05-01-1990  HYDERABAD           32          57    CLOUDY
5   06-01-1990  HYDERABAD           33          55     SUNNY
6   07-01-1990  BANGALORE           34          54     SUNNY
7   08-01-1990  BANGALORE           35          55     SUNNY
8   09-01-1990  BANGALORE           36          58     SUNNY
9   10-01-1990  BANGALORE           37          59     SUNNY
10  11-01-1990  BANGALORE           38          60    CLOUDY
11  12-01-1990  BANGALORE           39          61    CLOUDY

In [3]:
df.head(3)

         DATE       CITy  TEMPERATURE  HUMIDITY_% CONDITION
0  01-01-1900  HYDERABAD           28          60     SUNNY
1  02-01-1990  HYDERABAD           29          52     SUNNY
2  03-01-1990  HYDERABAD           30          58    CLOUDY

In [4]:
df.tail(3)

          DATE       CITy  TEMPERATURE  HUMIDITY_% CONDITION
9   10-01-1990  BANGALORE           37          59     SUNNY
10  11-01-1990  BANGALORE           38          60    CLOUDY
11  12-01-1990  BANGALORE           39          61    CLOUDY

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   DATE         12 non-null     object
 1   CITy         12 non-null     object
 2   TEMPERATURE  12 non-null     int64
 3   HUMIDITY_%   12 non-null     int64
 4   CONDITION    12 non-null     object
dtypes: int64(2), object(3)
memory usage: 612.0+ bytes

In [7]:
df.shape

(12, 5)

In [8]:
df[2:4]

         DATE       CITy  TEMPERATURE  HUMIDITY_% CONDITION
2  03-01-1990  HYDERABAD           30          58    CLOUDY
3  04-01-1990  HYDERABAD           31          55    CLOUDY

In [9]:
df.columns

Index(['DATE', 'CITy', 'TEMPERATURE', 'HUMIDITY_%', 'CONDITION'], dtype='object')

In [10]:
df.index

RangeIndex(start=0, stop=12, step=1)

In [11]:
df.dtypes

DATE           object
CITy           object
TEMPERATURE     int64
HUMIDITY_%      int64
CONDITION      object
dtype: object

In [13]:
df.DATE

0     01-01-1900
1     02-01-1990
2     03-01-1990
3     04-01-1990
4     05-01-1990
5     06-01-1990
6     07-01-1990
7     08-01-1990
8     09-01-1990
9     10-01-1990
10    11-01-1990
11    12-01-1990
Name: DATE, dtype: object

In [14]:
df[['DATE','CONDITION']]

          DATE CONDITION
0   01-01-1900     SUNNY
1   02-01-1990     SUNNY
2   03-01-1990    CLOUDY
3   04-01-1990    CLOUDY
4   05-01-1990    CLOUDY
5   06-01-1990     SUNNY
6   07-01-1990     SUNNY
7   08-01-1990     SUNNY
8   09-01-1990     SUNNY
9   10-01-1990     SUNNY
10  11-01-1990    CLOUDY
11  12-01-1990    CLOUDY

In [15]:
df['DATE'][df['CONDITION']=='CLOUDY']

2     03-01-1990
3     04-01-1990
4     05-01-1990
10    11-01-1990
11    12-01-1990
Name: DATE, dtype: object

# Reading Data

In [17]:
df = pd.DataFrame({
    "Name" : ["Vamsi","Raju","Madhu"],
    "Age" : [21,25,21]
})
df

    Name  Age
0  Vamsi   21
1   Raju   25
2  Madhu   21

In [18]:
df.head(2)

    Name  Age
0  Vamsi   21
1   Raju   25

In [19]:
df.tail(1)

    Name  Age
2  Madhu   21

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [21]:
df.shape

(3, 2)

In [22]:
df[1:2]

   Name  Age
1  Raju   25

In [23]:
df.columns

Index(['Name', 'Age'], dtype='object')

In [24]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [25]:
df.dtypes

Name    object
Age      int64
dtype: object

In [27]:
df.Name

0    Vamsi
1     Raju
2    Madhu
Name: Name, dtype: object

In [28]:
df[['Name','Age']]

    Name  Age
0  Vamsi   21
1   Raju   25
2  Madhu   21